<p>Vous pouvez envoyer un email &#xE0; chaque soumission, &#xE0; vous m&#xEA;me, au r&#xE9;pondant, aux deux, ou m&#xEA;me &#xE0; qui vous voulez. Cet email peut, si vous le souhaitez, contenir les valeurs saisies dans le formulaire. Pour ce faire vous devez vous rendre dans <strong>Formulaire</strong> &gt; <strong>Courriels</strong>.</p>
<p><img src="/profiles/framaforms_org/files/imgforms/fonctionnalites_forms_courriel.png" alt="Courriel"></p>
<p>Le mail par d&#xE9;faut comportera :</p>
<ul>
   <li>la date de soumission : <code>[submission:date:long]</code></li>
   <li>le nom de l&apos;utilisateur&#x22C5;trice (si cette personne est connect&#xE9;e &#xE0; un compte framaforms) : <code>[submission:user]</code></li>
   <li>les valeurs soumises : <code>[submission:values]</code></li>
   <li>le lien vers les r&#xE9;sultats : <code>[submission:url]</code></li>
</ul>
<p><img src="/profiles/framaforms_org/files/imgforms/fonctionnalites_forms_courriel_modele.png" alt="mod&#xE8;le de Courriel"></p>
<p>Vous avez trois possibilit&#xE9;s d&apos;envoi :</p>
<ul>
   <li><strong>Standard emails (always send)</strong> : cette fonctionnalit&#xE9; permet d&apos;envoyer un mail apr&#xE8;s chaque validation de formulaire</li>
   <li><strong>Confirmation request emails (always send)</strong> : permet d&apos;envoyer un mail &#xE0; la soumission, avec un lien de validation sur lequel il faut cliquer pour valider la soumission du formulaire</li>
   <li><strong>Confirmation emails (only send when the confirmation URL is used)</strong> : permet d&apos;envoyer un mail <strong>lorsque le/la r&#xE9;pondant&#x22C5;e a cliquer sur le lien du mail de confirmation</strong> (configur&#xE9; ci-dessus)</li>
</ul>
<h3 id="validation-de-la-soumission-par-email">Validation de la soumission par email</h3>
<p>Vous pouvez demander &#xE0; ce que la soumission soit confirm&#xE9;e par email. Par exemple si vous voulez &#xE9;viter qu&apos;une m&#xEA;me personne r&#xE9;ponde plusieurs fois. Cette derni&#xE8;re recevra alors un email de confirmation. Tant que l&apos;URL dans cet email n&apos;aura pas &#xE9;t&#xE9; cliqu&#xE9;e, sa r&#xE9;ponse au formulaire sera consid&#xE9;r&#xE9;e comme invalide.</p>
<p>Pour ce faire vous devez utiliser <strong>Confirmation request emails (always send)</strong> dans <strong>Formulaire</strong> &gt; <strong>Courriels</strong> et ajouter le jeton <code>[submission:confirm_url]</code> dans le mod&#xE8;le de courriel.</p>
<p>Par exemple&#xA0;:</p>
<pre><code>Vous avez r&#xE9;pondu au formulaire [current-page:title] le [submission:date:long]
Les valeurs soumises sont:
[submission:values]

Merci de bien vouloir confirmer votre participation en cliquant sur : [submission:confirm_url]
</code></pre>
<p>Vous pouvez ajouter un email &#xE0; envoyer apr&#xE8;s confirmation depuis <strong>Confirmation emails (only send when the confirmation URL is used)</strong>.</p>
<h3 id="page-de-confirmation-personnalis&#xE9;e">Page de confirmation personnalis&#xE9;e</h3>
<p>Vous pouvez d&#xE9;finir un message de confirmation, ou renvoyer le r&#xE9;pondant sur la page de votre choix (votre site web, par exemple)</p>
<p><img src="/profiles/framaforms_org/files/imgforms/fonctionnalites_forms_confirmation.png" alt="confirmation"></p>
<p>Pour cela, allez dans <strong>Param&#xE8;tres avanc&#xE9;s du formulaire</strong>, puis :</p>
<p>1) entrez le message que toute personne ayant r&#xE9;pondu au formulaire verra</p>
<p>2) (optionnel) cliquez sur <strong>Explorer les jetons disponibles</strong> pour ins&#xE9;rer des messages sp&#xE9;ciaux</p>
<p>3) (optionnel) choisir une variable (ici, une date)</p>
<p>4) (optionnel) cette variable affichera la date au format long : <code>Vendredi, ao&#xFB;t 18, 2017 - 14:34</code></p>
<p>5) apr&#xE8;s avoir r&#xE9;pondu au questionnaire, la r&#xE9;ponse personnalis&#xE9;e s&apos;affiche</p>
<p><img src="/profiles/framaforms_org/files/imgforms/fonctionnalites_forms_confirmation.gif" alt="confirmation gif"></p>